///////////////////////////////////////////////////////////////// Задание 1:///////////////////////////////////////////////////////////////

// 1. Создай объект user с полями: name, age, city
// 2. Преобразуй его в JSON строку
// 3. Выведи результат

// const user = { 
//     name: 'Андрей',
//     age: 28,
//     city: 'Москва',
// }

// const userDataToJson = JSON.stringify(user)
// console.log(userDataToJson)


///////////////////////////////////////////////////////////////// Задание 2:///////////////////////////////////////////////////////////////

// 1. Возьми JSON строку: '{"a":1,"b":2,"c":3}'
// 2. Преобразуй JSON строку обратно в объект
// 3. Выведи объект и доступ к свойству b

// const jsonString = '{"a":1,"b":2,"c":3}';

// const user = JSON.parse(jsonString)
// console.log(user); 
// console.log(user["b"]); 


///////////////////////////////////////////////////////////////// Задание 3:///////////////////////////////////////////////////////////////

// Глубокое копирование через JSON
// 1. Создай объект original = {a:1, b:{c:2}}
// 2. Создай его глубокую копию через JSON.parse(JSON.stringify())
// 3. Измени свойство original.b.c
// 4. Убедись что копия не изменилась

// const original = {a:1, b:{c:2}}

// const copy = JSON.parse(JSON.stringify(original))
// original.b.c = 999;
// console.log(copy)


///////////////////////////////////////////////////////////////// Задание 4:///////////////////////////////////////////////////////////////

// Массив объектов → JSON
// 1. Создай массив products = [
//      {id:1, title:"Milk"},
//      {id:2, title:"Bread"},
//      {id:3, title:"Tea"}
//    ]
// 2. Преобразуй массив в JSON строку
// // 3. Выведи результат

// const products = [
//      {id:1, title:"Milk"},
//      {id:2, title:"Bread"},
//      {id:3, title:"Tea"}
//    ]

// const userDataToJson = JSON.stringify(products)
// console.log(userDataToJson)


///////////////////////////////////////////////////////////////// Задание 5:///////////////////////////////////////////////////////////////

// JSON → массив объектов
// 1. Пусть есть JSON строка:
//    '[{"id":1,"score":10},{"id":2,"score":20},{"id":3,"score":30}]'
// 2. Преобразуй её в массив объектов
// 3. Выведи сумму всех score

// const jsonString = '[{"id":1,"score":10},{"id":2,"score":20},{"id":3,"score":30}]'

// const dataArray = JSON.parse(jsonString);

// let sum = 0;
// for (const item of dataArray) {
//     sum += item.score;
// }
// console.log(sum);






