///////////////////////////////////////////////////////////////// Задание 1:///////////////////////////////////////////////////////////////
// Базовый try/catch
// 1. Создай код, который пытается обратиться к несуществующей переменной
// 2. Перехвати ошибку через try/catch
// 3. В catch выведи: "Произошла ошибка"
// 4. После всего выведи "После try/catch"
// console.log(...) в каждом шаге

// console.log("До try/catch")

// try { 
//     const names = undefined

//     names.forEach((name) => {
//         console.log("Имя:", name)
//     })
// } catch (error) {
//     console.log("Произошла ошибка")
// }

// console.log("После try/catch")


///////////////////////////////////////////////////////////////// Задание 2:///////////////////////////////////////////////////////////////
// finally
// 1. Создай try/catch/finally
// 2. В try просто выведи "Начало"
// 3. В catch ничего не делай (пусть он не срабатывает)
// 4. В finally выведи "Всегда выполняется"
// Проверь что finally отработал

// try { 
//     console.log("Начало")
// } catch {

// } finally {
//     console.log("Всегда выполняется")
// }


///////////////////////////////////////////////////////////////// Задание 3:///////////////////////////////////////////////////////////////
// throw — выброс своей ошибки
// 1. Создай функцию checkAge(age)
// 2. Если age < 18 — выброси ошибку через throw "Несовершеннолетним нельзя"
// 3. Иначе выведи "Доступ разрешён"
// 4. Вызови checkAge в try/catch, обработай ошибку

// function checkAge(age) {
//     if (age < 18 ) {
//         throw "Несовершеннолетним нельзя"
//     }
//     else {
//         console.log("Доступ разрешён")
//     }
// }

// try { checkAge(15);
// } catch (error) {
//     console.log("Поймана ошибка: " + error);
// }


///////////////////////////////////////////////////////////////// Задание 4:///////////////////////////////////////////////////////////////
// создание объекта ошибки
// 1. Внутри try создай и выброси ошибку через:
//      throw new Error("Что-то пошло не так");
// 2. В catch выведи error.message
// 3. После этого выведи "Продолжаем работу"

// try { 
//     throw new error("Что-то пошло не так");
// } catch (error) {
//     console.log(error.message);
// }

// console.log("Продолжаем работу");


///////////////////////////////////////////////////////////////// Задание 5:///////////////////////////////////////////////////////////////
// finally при ошибке
// 1. Создай try/catch/finally
// 2. В try выброси ошибку
// 3. В catch выведи "Ошибка обработана"
// 4. В finally выведи "Очистка ресурсов"
// 5. Убедись, что finally выполняется даже при ошибке

// try { 
//     const names = undefined

//     names.forEach((name) => {
//         console.log("Имя:", name)
//     })
// } catch (error) {
//     console.log("Ошибка обработана")
// } finally {
//     console.log("Очистка ресурсов")
// }


///////////////////////////////////////////////////////////////// Задание 6:///////////////////////////////////////////////////////////////
// Перехват ошибки в функции
// 1. Создай функцию деления a на b, divide(a, b)
// 2. Если b === 0 — выброси ошибку "Деление на ноль"
// 3. Иначе верни результат
// 4. Вызови divide в try/catch и выведи ошибку

// function divide(a, b) {
//     if (b === 0) {
//         throw "Деление на ноль";
//     }
//         return a / b;
// }

// try { let result = divide(10, 0);
//     console.log("Результат:", result);
// } catch (error) {
//     console.log("Деление на ноль", error);
// }


///////////////////////////////////////////////////////////////// Задание 7:///////////////////////////////////////////////////////////////
// 1. Сделай JSON.parse("НЕ JSON")
// Обработай состояния успеха и ошибки при парсинге JSON.

// try {
//   const result = JSON.parse(Data);
//   console.log("Данные успешно получены:", result);
// } catch (error) {
//   console.error("Сообщение ошибки:", error.message);
// }


///////////////////////////////////////////////////////////////// Задание 8:///////////////////////////////////////////////////////////////
// 1. Создай функцию validateString(str)
// 2. Если передано не строка — выброси ошибку "Ожидается строка"
// 3. Если строка пустая — выброси ошибку "Строка пустая"
// 4. Иначе верни str.toUpperCase()
// 5. Вызови функцию несколько раз в try/catch с разными значениями
// 6. Выведи результаты

// function validateString(str) {
//     if (typeof str !== 'string') {
//         throw ("Ожидается строка");
//     }
//     if (str.trim() === "") {
//         throw ("Строка пустая");
//     }
//     else {
//         return str.toUpperCase();
//     }
// }

// const inputs = ["1", ""];

// inputs.forEach((input) => {
//     try {
//         const result = validateString(input);
//         console.log(result);
//     } catch (error) {
//         console.error(error.message);
//     }
// });
