///////////////////////////////////////////////////////////////// Задание 1:///////////////////////////////////////////////////////////////
// Создание простого промиса
// 1. Создай промис, который через 1 секунду resolve-ит строку "Готово!"
// 2. Обработай его и выведи результат

// const promise = new Promise((resolve, reject) => {
//     setTimeout(() => {
//         resolve("Готово!"); 
//     }, 1000);
// });

// promise.then(console.log);


///////////////////////////////////////////////////////////////// Задание 2:///////////////////////////////////////////////////////////////
// Промис с ошибкой
// 1. Создай промис, который через 3 секунды падает с ошибкой (ОШИБКА!)
// 2. Обработай его и выведи сообщение об ошибке

// const promise = new Promise((resolve, reject) => {
//     setTimeout(() => {
//         reject("ОШИБКА!"); 
//     }, 3000);
// });

// promise
//     .then((data) => {
//         console.log(data); 
//     })
//     .catch((error) => {
//         console.log(error);
//     });


///////////////////////////////////////////////////////////////// Задание 3:///////////////////////////////////////////////////////////////
// Цепочки промисов
// 1. Создай промис, который возвращает число 5
// 2. Дальше нужно умножить результат промиса на 10 и снова обернуть это в промис (в одну строчку! Никаких new Promise()))
// 3. Далее повтори то же самое, только к полученному числу прибавь 2 и выведи результат

// const promise = new Promise((resolve) => {
//     resolve (5)
// });

// promise
//   .then(data => data * 10)
//   .then(finalData => console.log(finalData + 2));


///////////////////////////////////////////////////////////////// Задание 4:///////////////////////////////////////////////////////////////
// async/await базовый
// 1. Создай функцию delay(ms), которая возвращает промис, resolve-ящийся через ms миллисекунд
// 2. Создай async функцию run()
// 3. Внутри run подожди 1 секунду с помощью функции delay и потом выведи "Прошло N секунд"
// 4. Вызови run()

// function delay(ms) {
//   return new Promise((resolve) => {
//     setTimeout(() => {
//         resolve(ms); 
//     }, ms);
//   });
// }

// async function run() {
//   await delay(1000);
//   console.log("Прошло 1 секунда");
// }


///////////////////////////////////////////////////////////////// Задание 5:///////////////////////////////////////////////////////////////
// try/catch в async/await
// 1. Создай функцию getError(), которая возвращает промис с reject("Ошибка!")
// 2. Создай async функцию test()
// 3. Внутри функции test() вызови await getError() и посмотри на результат. Если будет ошибка, обработай ее

// function getError() {
//   return new Promise((resolve, reject) => {
//         reject("Ошибка!");
//   });
// }

// async function test() {
//   try {
//     console.log("Запрос пошел...");
//     await getError();
//   } catch (error) {
//     console.error("Поймали ошибку:", error);
//   } finally {
//     console.log("Завершение работы.");
//   }
// }


///////////////////////////////////////////////////////////////// Задание 6:///////////////////////////////////////////////////////////////
// Знания async/await
// 1. Создай async функцию f(), которая возвращает число 42
// 2. Почему если обратиться к f(), то у нее можно вызвать .then()?

// async function f() {
//   return 42;
// }

// f().then(result => console.log(result)); // любая async функция всегда возвращает Promise


///////////////////////////////////////////////////////////////// Задание 7:///////////////////////////////////////////////////////////////
// Мини-проект "Имитация запроса"
// 1. Создай функцию fakeFetch(url), которая:
//      - если url === "/success", то через 1с resolve {status: 200, data: "ОК"}
//      - иначе через 1с reject({status: 404, message: "Не найдено"})
// 2. Создай функцию request(url), которая использует наш fakeFetch
// 3. Используй try/catch
// 4. Выведи либо успешный результат, либо ошибку
// 5. Проверь работу с "/success" и "/error"

// function fakeFetch(url) {
//   return new Promise((resolve, reject) => {
//     setTimeout(() => {
//       if (url === "/success") {
//         resolve({ status: 200, data: "ОК" });
//       } else {
//         reject({ status: 404, message: "Не найдено" });
//       }
//     }, 1000);
//   });
// }

// async function request(url) {
//     try {
//         console.log("Все хорошо");
//         const response = await fakeFetch(url);
//     } 
//     catch (error) {
//         console.error("Произошла ошибка:", error);
//     }    
// }

// request("/success");
// request("/error");


///////////////////////////////////////////////////////////////// Задание 8:///////////////////////////////////////////////////////////////
// Event Loop
// Объясни, почему ошибка не ловится?
try {
  setTimeout(() => { throw new Error("Boom") }, 0);
  } catch(e) {
  console.log("Caught!", e);
}
// И расскажи про подходы, как можно такие ошибки ловить?


// Ошибка не ловится из-за того, как Event Loop распределяет выполнение задач













