///////////////////////////////////////////////////////////////// Задание 1:///////////////////////////////////////////////////////////////
//    Базовый addEventListener
//    1. Создай кнопку "Нажми меня"
//    2. Добавь обработчик click
//    3. При клике выводи в консоль "Кнопка нажата!"

// const openButton = document.createElement("button");
// openButton.textContent = "Нажми меня";
// document.body.appendChild(openButton);

// openButton.addEventListener('click', () => {
//     console.log("Кнопка нажата!");
// });


///////////////////////////////////////////////////////////////// Задание 2:///////////////////////////////////////////////////////////////
//    Несколько обработчиков на один элемент
//    1. Добавь к кнопке два обработчика click:
//         - Первый выводит "Первый обработчик"
//         - Второй — "Второй обработчик"

const openButton = document.createElement("button");














