////////////////////// Задание 1:
// const str = " javascript is awesome ";

// Сделай следующие преобразования (по одному console.log на шаг): 
// 1. Удали пробелы с краёв 
// 2. Приведи к верхнему регистру 
// 3. Замени все вхождения "A" на "@" 
// 4. Возьми подстроку с 5-го символа до 12-го 
// 5. Повтори строку 3 раза через дефис "-" 
// 6. Добавь в начало и конец строки символы "🔥"

// function transformStr(input) {
    
//     const step1 = input.trim();
//     console.log(step1);

//     const step2 = input.toUpperCase();
//     console.log(step2);
    
//     const step3 = input.replace(/A/g, "@");
//     console.log(step3);

//     const step4 = input.substring(4, 12);
//     console.log(step4);

//     const step5 = input + "-" + input + "-" + input;
//     console.log(step5);

//     const step6 = "🔥" + input + "🔥";
//     console.log(step6);
    
//     return step6;
// }

// const str = " javascript is awesome ";
// console.log(transformStr(str));


/////////////////////////////// Задание 2:
// Выведи по одному console.log:
// 1. Цена с двумя знаками после запятой
// 2. Цена с разделителем тысяч (например "12 345.79 ₽")
// 3. Проверь, является ли число целым
// 5. Округли до ближайшего десятого вниз и выведи как число, потом снова как строку с "₽" в конце

function transformNum(number) {
    
    const step1 = number.toFixed(2);
    console.log("Округлили два знака после запятой:", step1);

    // const step2 = number.split('.');
    // console.log("Цена с разделителем тысяч:", step2);

    return step2;
}


const price = 12345.789;
transformNum(price);


