///////////////////////////////////////////////////////////////Задание 1:///////////////////////////////////////////////////////////////
// const str = " javascript is awesome ";

// Сделай следующие преобразования (по одному console.log на шаг): 
// 1. Удали пробелы с краёв 
// 2. Приведи к верхнему регистру 
// 3. Замени все вхождения "A" на "@" 
// 4. Возьми подстроку с 5-го символа до 12-го 
// 5. Повтори строку 3 раза через дефис "-" 
// 6. Добавь в начало и конец строки символы "🔥"

// function transformStr(input) {
    
//     const step1 = input.trim();
//     console.log(step1);

//     const step2 = input.toUpperCase();
//     console.log(step2);
    
//     const step3 = input.replace(/A/g, "@");
//     console.log(step3);

//     const step4 = input.substring(4, 12);
//     console.log(step4);

//     const step5 = input + "-" + input + "-" + input;
//     console.log(step5);

//     const step6 = "🔥" + input + "🔥";
//     console.log(step6);
    
//     return step6;
// }

// const str = " javascript is awesome ";
// console.log(transformStr(str));


/////////////////////////////// Задание 2:///////////////////////////////////////////////////////////////
// Выведи по одному console.log:
// 1. Цена с двумя знаками после запятой
// 2. Цена с разделителем тысяч (например "12 345.79 ₽")
// 3. Проверь, является ли число целым
// 5. Округли до ближайшего десятого вниз и выведи как число, потом снова как строку с "₽" в конце

// function transformNum(number) {
    
//     // первое задание
//     const step1 = number.toFixed(2);
//     console.log("Округлили два знака после запятой:", step1);

//     // второе задание
//     const step2 = number.split('.');
//     console.log("Цена с разделителем тысяч:", step2);

//     return step2;
// }


// const price = 12345.789;
// transformNum(price);


// 3. Проверь, является ли число целым
// function transformNum(number) {
    
//     const step = (number % 1 === 0);
    
//     console.log(step);
//     return step;
// }


// const price = 12345.789;
// transformNum(price);

// 5. Округли до ближайшего десятого вниз и выведи как число, потом снова как строку с "₽" в конце

// function transformNum(number) {

//    const step = Math.floor(number * 10) / 10;
//    console.log(step);
//    console.log(step + "₽");
// }

// const price = 12345.789;
// transformNum(price);




/////////////////////////////////////////////////////////////// Задание 3:///////////////////////////////////////////////////////////////

// 1. Удали пробелы с краёв 
// 2. Приведи к нижнему регистру 
// 3. Если длина меньше 4 или больше 16 символов — верни false 
// 4. Если начинается не с буквы — верни false
// 5. Если содержит пробел внутри — верни false 
// 6. Если всё ок — верни true и выведи "Логин валиден: cleanedUsername" 

// function validateUsername(username) { 

//     const step1 = username.trim();
//     const step2 = step1.toLowerCase();

//     if (step2.length < 4 || step2.length > 16) {
//         return false;
//     }

//     if (!/^[a-zа-яё]/.test(step2)) {
//         return false;
//     }

//     if (/\s/.test(step2)) {
//         return false;
//     }

//     return step2;
// }


// console.log("Логин валиден: cleanedUsername" );

/////////////////////////////////////////////////////////////// Задание 4:///////////////////////////////////////////////////////////////

// const rawPhone = "  7 923 456-78-90  ";

// function validateRawPhone(rawPhone) { 
//     let step1 = rawPhone.trim();
//     let step2 = step1.replace("923", "(923)");  
//     let result = "+" + step2;  

//     return result;
// }

// console.log(validateRawPhone(rawPhone));

// Сделай красивый номер +7 (923) 456-78-90
// Используй ТОЛЬКО методы строк и конкатенацию!
// Запрещено: split(), массивы, регулярные выражения

// Подсказка: убери все пробелы и дефисы, потом собирай по частям




/////////////////////////////////////////////////////////////// Задание 5:///////////////////////////////////////////////////////////////

// Посчитай количество слов в предложении БЕЗ split() и без массивов! 
// Подсказка: перебирай строку посимвольно и считай переходы с пробела на непробел 
// Выведи: "В предложении 6 слов"


// const sentence = "Я изучаю JavaScript каждый день";

// let wordCount = 0;
// let inWord = false;


// for (let i = 0; i < sentence.length; i++) {
//     const index = sentence[i];


//     if (index === ' ') {
//         inWord = false;
//     } 

//     else {
//         wordCount++;
//     }
// }

// console.log(`В предложении ${wordCount} слов`);

/////////////////////////////////////////////////////////////// Задание 6:///////////////////////////////////////////////////////////////

const fullName = " иванов Сергей Петрович ";

// Сделай аббревиатуру: "Иванов С. П." 
// Правила: 
// - Первая буква фамилии — заглавная, остальное строчные 
// - Инициалы от имени и отчества — заглавные с точкой 
// - Всё без массивов и split!

let surname = 
let name = 
let oldName = 


function validateRawPhone(rawPhone) { 
    let step1 = rawPhone.trim();
    let step2 = step1.replace("923", "(923)");  
    let result = "+" + step2;  

    return result;
}

console.log(validateRawPhone(rawPhone));





