///////////////////////////////////////////////////////////////// Задание 1:///////////////////////////////////////////////////////////////

// Создание и базовая работа с Map
// 1. Создай Map с ключами "name", "age", "city" и соответствующими значениями
// 2. Выведи значение ключа "name"
// 3. Добавь новую пару ключ-значение "country": "USA"
// 4. Удали ключ "age"
// 5. Проверь, есть ли ключ "city"
// 6. Выведи размер Map

// const data = new Map([
//     ['name', 'Андрей'],
//     ['age', 28],
//     ['city', 'Москва'],
// ]);

// console.log(data.get('name'))
// data.set('country', 'USA');
// data.delete('age');
// console.log(data.size);


///////////////////////////////////////////////////////////////// Задание 2:///////////////////////////////////////////////////////////////
// 1. Создай Map с несколькими ключами и значениями
// 2. Перебери Map удобным способом и выведи ключи и значения

// const data = new Map([
//     ['name', 'Андрей'],
//     ['age', 28],
//     ['city', 'Москва'],
// ]);

// console.log('keys:', data.keys());
// console.log('values:', data.values());
// console.log('entries:', data.entries());


///////////////////////////////////////////////////////////////// Задание 3:///////////////////////////////////////////////////////////////
//Map из массива и обратно
// 1. Создай массив пар: [["a", 1], ["b", 2], ["c", 3]]
// 2. Преобразуй его в Map
// 3. Преобразуй Map обратно в массив

// const data = [["a", 1], ["b", 2], ["c", 3]];

// const map = new Map(data);
// console.log(map);

// const mapToObject = Object.fromEntries(map);
// console.log(mapToObject);

// const objToMap = new Map(Object.entries(mapToObject));
// console.log("Map из объекта:", objToMap);


///////////////////////////////////////////////////////////////// Задание 4:///////////////////////////////////////////////////////////////

// Создание и базовая работа с Set
// 1. Создай Set из чисел: 1, 2, 3, 4, 5
// 2. Добавь число 3 (дубликат) и число 6
// 3. Удали число 2
// 4. Проверь, есть ли число 4
// 5. Выведи размер Set

// const set = new Set([1, 2, 3, 4, 5])
// set.add(3);
// set.add(6);
// set.delete(2);

// console.log(set);
// console.log(set.has(4));
// console.log(set.size);


///////////////////////////////////////////////////////////////// Задание 5:///////////////////////////////////////////////////////////////

// Перебор Set
// 1. Выведи все элементы Set через любой цикл или метод

// const set = new Set([1, 2, 3, 4, 5])

// for (const key of set.keys()) {
//     console.log(key)
// }


///////////////////////////////////////////////////////////////// Задание 6:///////////////////////////////////////////////////////////////

// Уникальные значения из массива
// 1. Пусть есть массив numbers = [1, 2, 2, 3, 4, 4, 5]
// 2. Используя Set, создай массив уникальных чисел

// numbers = [1, 2, 2, 3, 4, 4, 5]
// console.log(numbers);

// const setFromArray = new Set(numbers);
// console.log(setFromArray);


