///////////////////////////////////////////////////////////////// Задание 1:///////////////////////////////////////////////////////////////

// Создание и базовая работа с Map
// 1. Создай Map с ключами "name", "age", "city" и соответствующими значениями
// 2. Выведи значение ключа "name"
// 3. Добавь новую пару ключ-значение "country": "USA"
// 4. Удали ключ "age"
// 5. Проверь, есть ли ключ "city"
// 6. Выведи размер Map

// const data = new Map([
//     ['name', 'Андрей'],
//     ['age', 28],
//     ['city', 'Москва'],
// ]);

// console.log(data.get('name'))
// data.set('country', 'USA');
// data.delete('age');
// console.log(data.size);


///////////////////////////////////////////////////////////////// Задание 2:///////////////////////////////////////////////////////////////
// 1. Создай Map с несколькими ключами и значениями
// 2. Перебери Map удобным способом и выведи ключи и значения

// const data = new Map([
//     ['name', 'Андрей'],
//     ['age', 28],
//     ['city', 'Москва'],
// ]);

// console.log('keys:', data.keys());
// console.log('values:', data.values());
// console.log('entries:', data.entries());


///////////////////////////////////////////////////////////////// Задание 3:///////////////////////////////////////////////////////////////
//Map из массива и обратно
// 1. Создай массив пар: [["a", 1], ["b", 2], ["c", 3]]
// 2. Преобразуй его в Map
// 3. Преобразуй Map обратно в массив

const data = new Map([["a", 1], ["b", 2], ["c", 3]]);

const map = new Map(Object.entries(data))

map.forEach((value, key) => {
    console.log(`${key}: ${value}`)
})






























